app/views/subjects/index.html.erb

SELECT COUNT(*) FROM `subjects`
SELECT `subjects`.* FROM `subjects`  ORDER BY subjects.position ASC
---
  <!--单复数-->
  <div><%= pluralize(@subjects.size, 'subject') %> found</div>

SELECT COUNT(*) FROM `pages` WHERE `pages`.`subject_id` = 1
---
      <td class="center"><%= status_tag(subject.visible) %></td>
      <td class="center"><%= subject.pages.size %></td>