app/controllers/pages_controller.rb

SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1
---
  def show
    @page = Page.find(params[:id])

SELECT `subjects`.* FROM `subjects`  ORDER BY position ASC
SELECT COUNT(*) FROM `pages`
---
  def new
    @page = Page.new({:subject_id => @subject.id, :name => "Default"})
    @subjects=Subject.order('position ASC')
    @page_count=Page.count+1

INSERT INTO `pages` (`subject_id`, `name`, `permalink`, `position`, `created_at`, `updated_at`) VALUES (1, 'TestPage', 'test', 1, '2015-03-11 04:58:55.065885', '2015-03-11 04:58:55.065885')
---
  def create
    @page = Page.new(page_params)
    if @page.save

SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1
SELECT `subjects`.* FROM `subjects`  ORDER BY position ASC
SELECT COUNT(*) FROM `pages`
---
  def edit
    @page = Page.find(params[:id])
    @subjects=Subject.order('position ASC')
    @page_count=Page.count

SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1
UPDATE `pages` SET `permalink` = '3-testpage', `updated_at` = '2015-03-11 05:09:02.645960' WHERE `pages`.`id` = 3
---
  def update
    @page = Page.find(params[:id])
    if @page.update_attributes(page_params)

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 2 LIMIT 1
---
    def find_subject
      if params[:subject_id]
        @subject = Subject.find(params[:subject_id])