app/controllers/public_controller.rb

  def show
    @page = Page.where(:permalink => params[:permalink], :visible => true).first
---
SELECT  `pages`.* FROM `pages` WHERE `pages`.`permalink` = 'second' AND `pages`.`visible` = 1  ORDER BY `pages`.`id` ASC LIMIT 1