app/controllers/sections_controller.rb

  def show
    @section = Section.find(params[:id])
---
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1

  def new
    @section = Section.new({:name => "Default"})
    @pages=Page.order('position ASC')
    @section_count=Section.count+1
---
SELECT `pages`.* FROM `pages`  ORDER BY position ASC
SELECT COUNT(*) FROM `sections`

  def create
    @section = Section.new(section_params)
    if @section.save
---
INSERT INTO `sections` (`name`, `position`, `content_type`, `content`, `created_at`, `updated_at`) VALUES ('Section ONE', 1, '', '', '2015-03-10 06:19:56.505019', '2015-03-10 06:19:56.505019')

  def edit
    @section = Section.find(params[:id])
    @pages = @page.subject.pages.sorted
    @section_count=Section.count
---
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `sections`

  def update
    @section = Section.find(params[:id])
    if @section.update_attributes(section_params)
      flash[:notice] = "Section updated successfully."
      redirect_to(:action => 'show', :id => @section.id, :page_id => @page.id)
    else
      @pages=Page.order('position ASC')
      @section_count=Section.count
---
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
UPDATE `sections` SET `page_id` = 2, `visible` = 1, `content_type` = 'text', `content` = 'test', `updated_at` = '2015-03-11 04:42:28.468943' WHERE `sections`.`id` = 1
SELECT `pages`.* FROM `pages`  ORDER BY position ASC
SELECT COUNT(*) FROM `sections`

  def delete
    @section = Section.find(params[:id])
---
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1

    def find_page
      if params[:page_id]
        @page = Page.find(params[:page_id])
---
SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1