app/controllers/subjects_controller.rb

  def new
    @subject=Subject.new({:name=>'Default'})
    @subject_count=Subject.count+1
---
SELECT COUNT(*) FROM `subjects`

  def create
    @subject = Subject.new(subject_params)
    # Save the object
    if @subject.save
      # If save succeeds, redirect to the index action
      flash[:notice] = "Successfully created..."
      redirect_to(:action => 'index')
    else
      # If save fails, redisplay the form so user can fix problems
      @subject_count=Subject.count+1
---
INSERT INTO `subjects` (`name`, `position`, `visible`, `created_at`, `updated_at`) VALUES ('Test Subject', 8, 1, '2015-03-10 05:38:09.152052', '2015-03-10 05:38:09.152052')
SELECT COUNT(*) FROM `subjects`

  def edit
    @subject = Subject.find(params[:id])
    @subject_count=Subject.count
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 4 LIMIT 1
SELECT COUNT(*) FROM `subjects`

  def update
    #find an existing object using form parameters
    @subject = Subject.find(params[:id])
    #update the object
    if @subject.update_attributes(subject_params)
      # If save succeeds, redirect to the index action
      flash[:notice] = "Successfully updated..."
      redirect_to(:action => 'show',:id=>@subject.id)
    else
      # If save fails, redisplay the form so user can fix problems
      @subject_count=Subject.count
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 4 LIMIT 1
UPDATE `subjects` SET `name` = 'Grammar', `position` = 2, `updated_at` = '2015-03-17 00:19:20.522715' WHERE `subjects`.`id` = 148
SELECT COUNT(*) FROM `subjects` WHERE (1 = 1 AND position = 1)

  def delete
    @subject = Subject.find(params[:id])
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 4 LIMIT 1

  def destroy
    @subject = Subject.find(params[:id]).destroy
---
DELETE FROM `subjects` WHERE `subjects`.`id` = 4
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 4 LIMIT 1